---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.TextRange
source: html/3036d128-6be4-2e14-a1b4-fae307429140.htm
---
# TextRange Members

Constructs a TextRange with default values for start and length.